In [1]:
import pandas as pd

### Connect Pandas to the database with this URL:

In [2]:
titles = pd.read_csv('C:\\Users\\Beasty\\LightHouseLabs\\titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [2]:
cast = pd.read_csv('C:\\Users\\Beasty\\LightHouseLabs\\cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [19]:
most_common= titles.groupby(['title']).agg(['count']).sort_values(by=("year", 'count'), ascending=False)
most_common[0:10]

                      year
                     count
title
Hamlet                  18
Carmen                  16
Macbeth                 15
The Outsider            12
Maya                    12
Freedom                 11
The Three Musketeers    11
Temptation              11
Othello                 11
Kismet                  11

### Which three years of the 1930s saw the most films released?

In [28]:
top3_1930s=titles[titles['year'].isin(range(1930,1940))].groupby(['year']).agg(['count']).sort_values((
                'title','count'), ascending=False)
top3_1930s[0:3]

     title
     count
year
1937  1196
1936  1138
1938  1129

### Count the number of films that have been released each decade over the history of cinema.

In [33]:
titles['decade']=titles['year'] - (titles['year']%10)
titles

                                       title  year  decade
0                             The Rising Son  1990    1990
1                    The Thousand Plane Raid  1969    1960
2                           Crucea de piatra  1993    1990
3                                    Country  2000    2000
4                                 Gaiking II  2011    2010
...                                      ...   ...     ...
232325                                 E yue  2005    2000
232326                          Lakota Girls  2015    2010
232327                        Kroniki domowe  1997    1990
232328                  Awakening the Zodiac  2017    2010
232329  Death in the Valley of Good and Evil  2018    2010

[232330 rows x 3 columns]

In [35]:
titles[['title', 'decade']].groupby(['decade']).count()

        title
decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210

### Count the number of "Hamlet" films made each decade.

In [37]:
titles[['title', 'decade']][titles['title']=="Hamlet"].groupby(['decade']).count()

        title
decade
1910        3
1920        1
1940        1
1950        1
1960        2
1970        2
1980        1
1990        2
2000        2
2010        3

### Count the number of "Rustler" characters in each decade of the history of film.

In [41]:
cast['decade']=cast['year'] - (cast['year']%10)
cast.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [42]:
cast[['decade', 'character']][cast['character']=="Rustler"].groupby(['decade']).agg(['count'])

       character
           count
decade
1920           6
1930          84
1940          18
1950           8
1960           2
1970           9
1980           1
1990           4
2000           2

### Count the number of "Hamlet" characters each decade.

In [43]:
cast[['decade', 'character']][cast['character']=="Hamlet"].groupby(['decade']).agg(['count'])

       character
           count
decade
1910           6
1920           1
1930           6
1940           1
1950           3
1960           7
1970           8
1980           2
1990          11
2000          19
2010          28

### What are the 11 most common character names in movie history?

In [50]:
common_character=cast[['character', 'title']].groupby(['character']).agg(['count']).sort_values(('title',
                                                                                                 'count'), ascending=False)
common_character[0:11]

             title
             count
character
Himself      19600
Dancer       12096
Extra        10953
Reporter      8154
Doctor        7436
Student       7177
Policeman     6883
Party Guest   6742
Nurse         6676
Bartender     6613
Minor Role    6255

### Who are the 10 people most often credited as "Herself" in film history?

In [56]:
most_common_herself=cast[['name', 'title']][cast['character']=="Herself"].groupby(['name']).agg(['count']).sort_values(('title',
                                                                                                    'count'), ascending=False)
most_common_herself[0:10]

                   title
                   count
name
Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Hillary Clinton        7
Mary Jo Pehl           7
Joan Rivers            6
Sumie Sakai            6
Bunny Yeager           5
Kareena Kapoor         5
Rekha                  5

### Who are the 10 people most often credited as "Himself" in film history?

In [57]:
most_common_himself=cast[['name', 'title']][cast['character']=="Himself"].groupby(['name']).agg(['count']).sort_values(('title',
                                                                                                    'count'), ascending=False)
most_common_himself[0:10]

                      title
                      count
name
Adolf Hitler            100
Richard Nixon            46
Ronald Reagan            39
John F. Kennedy          34
Winston Churchill        24
Benito Mussolini         23
Ron Jeremy               23
George W. Bush           23
Martin Luther King       21
Franklin D. Roosevelt    20

### Which actors or actresses appeared in the most movies in the year 1945?

In [67]:
cast[['name', 'title']][cast['year']==1945].groupby(['name']).count().sort_values(('title'), ascending=False)

                 title
name
Emmett Vogan        39
Sam (II) Harris     32
Bess Flowers        29
Harold Miller       29
Nolan Leary         27
...                ...
Herbert Cameron      1
Herb Lurie           1
Henry Wolston        1
Henry Wadsworth      1
Jim Basquette        1

[7802 rows x 1 columns]

### Which actors or actresses appeared in the most movies in the year 1985?

In [68]:
cast[['name', 'title']][cast['year']==1985].groupby(['name']).count().sort_values(('title'), ascending=False)

                title
name
Mammootty          22
Shakti Kapoor      21
Sukumari           20
Raj Babbar         15
Lou Scheimer       15
...               ...
Henri G?n?s         1
Henri Fridlani      1
Henri Czarniak      1
Henri Attal         1
Kamil Imbondo       1

[22609 rows x 1 columns]

### How many roles Mammootty has played in each year of his career.

In [73]:
cast[['year', 'name']][cast['name']=="Mammootty"].groupby(['year']).count()

      name
year
1971     1
1980     2
1981     3
1982     7
1983    18
1984    16
1985    22
1986    18
1987     9
1988     7
1989    10
1990    15
1991     6
1992     3
1993     5
1994     5
1995     5
1996     3
1997     2
1998     4
1999     4
2000     7
2001     3
2002     3
2003     2
2004     8
2005     6
2006     8
2007     7
2008     9
2009    12
2010     9
2011     7
2012     7
2013     5
2014     6
2015     6
2016     4
2017     1

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [7]:
most_common_roles=cast[['character', 'title']][cast['character'].str.contains("Patron in")].groupby(['character'
                                                ]).count().sort_values(('title'), ascending=False)
most_common_roles[0:10]

                              title
character
Patron in Frisky Rabbit          16
Patron in the Coffee House        9
Patron in Chinese Restaurant      9
Patron in Billiard Parlor         5
Patron in Bar                     4
Patron in restaurant              4
Patron in Club                    3
Patron in Restaurant              3
Patron in cabaret                 3
Patron in Audience                2

### What are the 10 most frequent roles that start with the word "Science"?

In [8]:
most_common_roles=cast[['character', 'title']][cast['character'].str.startswith("Science")].groupby(['character'
                                                ]).count().sort_values(('title'), ascending=False)
most_common_roles[0:10]

                      title
character
Science Teacher          60
Science Student           9
Science Fair Student      9
Science Fair Judge        6
Science Reporter          5
Science Promo Cadet       5
Science Club Member       5
Science Kid               5
Science                   4
Science Officer           3

### Count number of n-values of the roles that Judi Dench has played over her career.

In [10]:
cast[['n', 'name']][cast['name']=='Judi Dench'].groupby(['n']).count()

      name
n
1.0      6
2.0      6
3.0      6
4.0      4
5.0      2
6.0      4
7.0      4
8.0      1
9.0      1
12.0     3
13.0     2
16.0     2
18.0     2
20.0     1
23.0     1
26.0     1
29.0     1
40.0     1

### Count number of n-values of Cary Grant's roles through his career.

In [11]:
cast[['n', 'name']][cast['name']=='Cary Grant'].groupby(['n']).count()

      name
n
1.0     46
2.0     20
3.0      2
4.0      1
5.0      1
8.0      1
9.0      2
10.0     2

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [12]:
cast[['n', 'name']][cast['name']=='Sidney Poitier'].groupby(['n']).count()

      name
n
1.0     21
2.0      8
3.0      6
4.0      3
5.0      1
10.0     1
13.0     1
21.0     1

In [13]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [19]:
cast[['type', 'year']][(cast['year'].isin(range(1950,1960))) & (cast['n']==1)].groupby(['type']).count()

         year
type
actor    6616
actress  2965

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [20]:
cast[['type', 'year']][(cast['year'].isin(range(1950,1960))) & (cast['n']==2)].groupby(['type']).count()

         year
type
actor    4564
actress  4556